Repository: uyiai/uyiprompt
Catalog: uyiprompt/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# access.caption
source: Read selected text and paste the result back.
zh_hans: 读取选中的文字，并把改写或译文写回去。

# access.enable
source: Enable
zh_hans: 去开启

# access.off
source: Off
zh_hans: 未开启

# access.on
source: On
zh_hans: 已开启

# access.title
source: Accessibility
zh_hans: 辅助功能

# appDefaults.actionBar
source: Action bar
zh_hans: 动作条

# appDefaults.follow
source: Follow current style
zh_hans: 跟随当前风格

# appDefaults.profile
source: Style
zh_hans: 风格

source: Appearance
zh_hans: 外观

# appearance.dark
source: Dark
zh_hans: 深色

# appearance.light
source: Light
zh_hans: 浅色

# appearance.system
source: System
zh_hans: 跟随系统

# appearance.theme
source: Theme
zh_hans: 主题

# desktop.autoRun
source: Start rewriting immediately
zh_hans: 点「改写」后立刻开始

# desktop.autoRun.caption
source: When off, the overlay opens first so you can pick a style.
zh_hans: 关掉后，会先弹出窗口让你选风格再改写。

# desktop.dock
source: Show in Dock
zh_hans: 在程序坞显示图标

# desktop.launchAtLogin
source: Launch at login
zh_hans: 开机自动启动

# desktop.pin
source: Keep panel on top
zh_hans: 面板始终置顶

# desktop.popover
source: Show result overlay after rewrite
zh_hans: 改写后弹出结果窗

# enhance.output
source: Rewrite output
zh_hans: 改写输出

# enhance.output.caption
source: Auto keeps the original language.
zh_hans: 自动会保持原文语言。

# error.access
source: Accessibility doesn’t match this build. In System Settings → Privacy & Security → Accessibility, remove the old uyiprompt, then add this one from Applications.
zh_hans: 辅助功能开关对不上当前这份程序。请到系统设置 → 隐私与安全性 → 辅助功能：删掉旧的 uyiprompt，再把「应用程序」里的 uyiprompt 拖进去打开。

# error.dns
source: Server not found. Check the base URL
zh_hans: 找不到服务器，请检查接口地址是否正确

# error.empty
source: Select some text, then tap Rewrite or Translate
zh_hans: 先选中一段文字，再点弹出的「改写」或「翻译」

# error.emptyResponse
source: The model returned nothing. Try again.
zh_hans: 模型没有返回内容，请再试一次

# error.http
source: Server error (%d)
zh_hans: 服务返回错误（%d）

# error.http401
source: Invalid key or no permission. Check the API key in Settings
zh_hans: 密钥无效或没权限，请到设置里核对 API Key

# error.http404
source: Base URL or model name may be wrong
zh_hans: 接口地址或模型名可能不对，请检查 Base URL 和模型

# error.http429
source: Too many requests or quota used up. Try again later
zh_hans: 请求太频繁或额度用完了，稍后再试

# error.httpBody
source: Server error (%d): %@
zh_hans: 服务返回错误（%d）：%@

# error.missingKey
source: No API key yet. Open Settings, pick DeepSeek, and paste your key.
zh_hans: 还没有填 API Key。打开设置，选 DeepSeek 后贴上密钥即可。

# error.missingModel
source: No model name yet. DeepSeek often uses deepseek-v4-flash
zh_hans: 还没有填模型名。DeepSeek 常用 deepseek-v4-flash

# error.missingURL
source: No base URL yet. For DeepSeek that’s usually https://api.deepseek.com/v1
zh_hans: 还没有填接口地址。DeepSeek 一般是 https://api.deepseek.com/v1

# error.network
source: No network. Check the connection and try again
zh_hans: 网络不通，请检查网络后重试

# error.noSelection
source: Couldn’t read the selection. Select it again, or open the panel and paste.
zh_hans: 没读到选中的文字。再选一次，或打开面板把文字贴进去。

# error.offline
source: You appear to be offline. Check the connection and try again
zh_hans: 当前没有网络连接，请检查网络后重试

# error.pasteAccess
source: Couldn’t paste back: Accessibility doesn’t match. Copy instead.
zh_hans: 还写不回去：辅助功能对不上当前程序。可以先点「复制」。

# error.pasteFail
source: Couldn’t paste back
zh_hans: 没能粘贴回去

# error.selectOther
source: Select text in another app first, or open the panel and paste.
zh_hans: 请先在别的软件里选中文字，或打开面板贴进去。

# error.switchApp
source: Switch back to the original app and try again
zh_hans: 请切回原来的软件再试一次

# error.timeout
source: The request timed out. Try again.
zh_hans: 请求超时了，网络或服务较慢，请重试

# error.tls
source: Secure connection failed. Check the base URL or your network
zh_hans: 建立安全连接失败，请检查接口地址或网络环境

# error.tooLong
source: That’s too long — 50,000 characters max
zh_hans: 文字太长了，最多 5 万字

# error.truncated
source: The result may be truncated: the model hit its output limit
zh_hans: 结果可能被截断了：文字较长，模型输出达到了上限

# hint.action
source: Select text, then Rewrite or Translate
zh_hans: 选中文字后点「改写」或「翻译」

# hint.menubar
source: Now in the menu bar
zh_hans: 已经放到菜单栏

# history.clear
source: Clear
zh_hans: 清空

# history.copyOriginal
source: Copy original
zh_hans: 复制原文

# history.copyResult
source: Copy result
zh_hans: 复制结果

# history.delete
source: Delete
zh_hans: 删除

# history.empty
source: Nothing yet. Successful rewrites and translations show up here.
zh_hans: 还没有记录。改写或翻译成功后会出现在这里。

# history.record
source: Keep recent rewrites and translations
zh_hans: 记录最近的改写和翻译

# history.record.caption
source: When off, originals and results are no longer written to the local history file.
zh_hans: 关掉后不再把原文和结果写入本机的历史文件。

# history.reuse
source: Send to panel
zh_hans: 放到面板

# howto.action
source: Rewrite or Translate
zh_hans: 改写或翻译

# howto.replace
source: Replace
zh_hans: 点「替换」

# howto.select
source: Select text
zh_hans: 选中文字

# job.enhance
source: Rewrite
zh_hans: 改写

# job.enhanceSelection
source: Rewrite selection
zh_hans: 改写选中文字

# job.translate
source: Translate
zh_hans: 翻译

# job.translateSelection
source: Translate selection
zh_hans: 翻译选中文字

# lang.auto
source: Auto
zh_hans: 自动

# lang.autoKeep
source: Auto (keep original)
zh_hans: 自动（保持原文语言）

# lang.autoPair
source: Auto (Chinese ↔ English)
zh_hans: 自动（中英互译）

# lang.chinese
source: Chinese
zh_hans: 中文

# lang.czech
source: Czech
zh_hans: 捷克语

# lang.english
source: English
zh_hans: 英语

# lang.esShort
source: Spanish
zh_hans: 西语

# lang.french
source: French
zh_hans: 法语

# lang.german
source: German
zh_hans: 德语

# lang.hindi
source: Hindi
zh_hans: 印地语

# lang.japanese
source: Japanese
zh_hans: 日语

# lang.korean
source: Korean
zh_hans: 韩语

# lang.portuguese
source: Portuguese
zh_hans: 葡萄牙语

# lang.ptShort
source: Portuguese
zh_hans: 葡语

# lang.russian
source: Russian
zh_hans: 俄语

# lang.simplified
source: Simplified Chinese
zh_hans: 简体中文

# lang.spanish
source: Spanish
zh_hans: 西班牙语

# lang.vietnamese
source: Vietnamese
zh_hans: 越南语

# language.caption
source: Switch the interface between Chinese and English.
zh_hans: 立刻切换应用内的中文和英文。

# language.section
source: App language
zh_hans: 界面语言

# language.system
source: System
zh_hans: 跟随系统

# menu.checkUpdates
source: Check for Updates…
zh_hans: 检查更新…

# menu.close
source: Close
zh_hans: 关闭

# menu.copy
source: Copy
zh_hans: 复制

# menu.currentProfile
source: Style: %@
zh_hans: 当前风格：%@

# menu.cut
source: Cut
zh_hans: 剪切

# menu.edit
source: Edit
zh_hans: 编辑

# menu.enableAccess
source: Enable Accessibility…
zh_hans: 开启辅助功能…

# menu.fillKey
source: Add API Key…
zh_hans: 填写 API Key…

# menu.minimize
source: Minimize
zh_hans: 最小化

# menu.noProfiles
source: No styles yet
zh_hans: 还没有风格

# menu.noRecent
source: No recent items
zh_hans: 还没有记录

# menu.onboarding
source: How to Use
zh_hans: 使用说明

# menu.openPanel
source: Open Panel
zh_hans: 打开面板

# menu.paste
source: Paste
zh_hans: 粘贴

# menu.providers
source: Models
zh_hans: 模型服务

# menu.quit
source: Quit uyiprompt
zh_hans: 退出 uyiprompt

# menu.recent
source: Recent
zh_hans: 最近

# menu.redo
source: Redo
zh_hans: 重做

# menu.selectAll
source: Select All
zh_hans: 全选

# menu.settings
source: Settings…
zh_hans: 设置…

# menu.undo
source: Undo
zh_hans: 撤销

# menu.window
source: Window
zh_hans: 窗口

# model.advancedURL
source: Advanced: base URL
zh_hans: 高级：接口地址

# model.advancedURL.caption
source: Usually leave the default.
zh_hans: 一般不用改。

# model.balanced
source: Balanced
zh_hans: 均衡

# model.baseURL
source: Base URL
zh_hans: 接口地址

# model.baseURL.caption
source: OpenAI-compatible /v1/chat/completions.
zh_hans: 使用 OpenAI 兼容的 /v1/chat/completions。

# model.best
source: Best
zh_hans: 最强

# model.cheap
source: Fast
zh_hans: 快省

# model.coding
source: Code
zh_hans: 编程

# model.download
source: Download
zh_hans: 去下载

# model.fast
source: Fast
zh_hans: 快

# model.fetch
source: Fetch models
zh_hans: 获取模型列表

# model.fetchEmpty
source: No models returned; enter the model name manually
zh_hans: 接口没有返回模型，请手动填写模型名

# model.fetched
source: Fetched %d models
zh_hans: 获取到 %d 个模型

# model.flagship
source: Flagship
zh_hans: 旗舰

# model.general
source: General
zh_hans: 通用

# model.getKey
source: Get a key
zh_hans: 去申请密钥

# model.hasKey
source: Key saved
zh_hans: 已填密钥

# model.hideKey
source: Hide key
zh_hans: 隐藏密钥

# model.keyOptionalPlaceholder
source: Local server — leave empty
zh_hans: 本地服务无需密钥，留空即可

# model.keyPlaceholder
source: Paste your key. It stays on this Mac.
zh_hans: 粘贴密钥，只存在这台电脑

# model.missingKey
source: API key missing
zh_hans: 还差 API Key

# model.missingModel
source: Model missing
zh_hans: 还差模型名

# model.missingURL
source: Base URL missing
zh_hans: 还差接口地址

# model.model
source: Model
zh_hans: 模型

# model.modelPlaceholder
source: Model name
zh_hans: 模型名，可手填

# model.oldName
source: legacy
zh_hans: 旧名

# model.showKey
source: Show key
zh_hans: 显示密钥

# model.strong
source: Strong
zh_hans: 强

# model.test
source: Test connection
zh_hans: 测试连接

# model.testOK
source: Connected. You’re ready.
zh_hans: 连接成功，可以用了

# model.thinking
source: Thinking
zh_hans: 打开思考

# model.thinking.caption
source: Leave this off for rewrites — faster and cheaper. Turn on for code or hard edits.
zh_hans: 改写一般不用开，更快更省。编程、长文、难改时再开。

# model.thinkingOld
source: Thinking
zh_hans: 思考

# model.thinkingSuffix
source: · thinking
zh_hans: · 思考

# nav.appDefaults
source: Per app
zh_hans: 按应用

# nav.connected
source: Connected
zh_hans: 已连接

# nav.disconnected
source: Not connected
zh_hans: 未连接

# nav.general
source: General
zh_hans: 通用

# nav.history
source: History
zh_hans: 历史

# nav.profiles
source: Styles
zh_hans: 写作风格

# nav.providers
source: Models
zh_hans: 模型服务

# nav.shortcuts
source: Shortcuts
zh_hans: 快捷键

# onboard.access.caption
source: So uyiprompt can read the selection and paste back. It only runs when you select text.
zh_hans: 这样才能读到你选中的字，并把结果粘贴回去。只在你选中文字时工作，可以稍后开启。

# onboard.access.need
source: Not enabled yet. This opens System Settings.
zh_hans: 还没开启，点下面会跳到系统设置

# onboard.access.ok
source: Already on — continue
zh_hans: 已经开启，可以继续

# onboard.access.open
source: Open System Settings
zh_hans: 打开系统设置

# onboard.access.title
source: Accessibility is required
zh_hans: 需要「辅助功能」

# onboard.back
source: Back
zh_hans: 上一步

# onboard.continue
source: Continue
zh_hans: 继续

# onboard.later
source: Skip for now
zh_hans: 稍后再说

# onboard.menubar
source: Move to the menu bar
zh_hans: 先放到菜单栏

# onboard.model.need
source: DeepSeek is recommended. The key stays on this Mac.
zh_hans: 推荐 DeepSeek。密钥只存在这台电脑，不会上传到我们这边。

# onboard.model.ready
source: You’re connected. You can start, or switch to DeepSeek.
zh_hans: 已经连上了，可以直接开始。也可以换成 DeepSeek。

# onboard.model.title
source: Connect a model
zh_hans: 连接模型

# onboard.start
source: Get started
zh_hans: 开始使用

# onboard.step1.caption
source: Works in WeChat, browsers, and editors.
zh_hans: 在微信、浏览器、编辑器里都可以。

# onboard.step1.title
source: Select some text
zh_hans: 选中一段文字

# onboard.step2.caption
source: The chips appear below the selection when you release the mouse, clear of the host Copy menu.
zh_hans: 松开鼠标后会出现在选区下方，避开复制菜单。

# onboard.step2.title
source: Tap Rewrite or Translate
zh_hans: 点「改写」或「翻译」

# onboard.step3.caption
source: Or just copy, and leave the original alone.
zh_hans: 也可以只复制，不改原来的内容。

# onboard.step3.title
source: Replace the original
zh_hans: 替换回原文

# onboard.welcome.caption
source: Lives in the menu bar. Select a sentence, then tap the chips.
zh_hans: 待在菜单栏。选中一段话，点选区下方的按钮即可。

# onboard.welcome.title
source: Select text, then rewrite or translate
zh_hans: 选中文字，改写或翻译

# palette.hint
source: 1-9 pick a style · Return uses current · Esc closes
zh_hans: 按 1-9 选风格 · 回车用当前风格 · Esc 关闭

# panel.again.enhance
source: Rewrite again
zh_hans: 再改一次

# panel.again.translate
source: Translate again
zh_hans: 再译一次

# panel.copied
source: Copied
zh_hans: 已复制

# panel.copy
source: Copy
zh_hans: 复制

# panel.fill
source: Add key
zh_hans: 去填写

# panel.goKey
source: Add API key
zh_hans: 去填写密钥

# panel.hide
source: Hide
zh_hans: 收起

# panel.into
source: Into
zh_hans: 译成

# panel.needAccess
source: Accessibility doesn’t match this app, so selection can’t be read
zh_hans: 辅助功能对不上当前程序，读不了选中文字

# panel.needKey
source: Add an API key to rewrite and translate
zh_hans: 还差 API Key，填上就能改写和翻译

# panel.pin
source: Always on top
zh_hans: 始终置顶

# panel.placeholder.enhance
source: Paste text to rewrite
zh_hans: 粘贴要改的文字

# panel.placeholder.hint
source: Or select text in another app and use the chips
zh_hans: 或在别的软件里选中后点弹出的按钮

# panel.placeholder.translate
source: Paste text to translate
zh_hans: 粘贴要译的文字

# panel.style
source: Style
zh_hans: 风格

# panel.working.enhance
source: Rewriting…
zh_hans: 正在改写…

# panel.working.translate
source: Translating…
zh_hans: 正在翻译…

# popover.close
source: Close
zh_hans: 关闭

# popover.loading.enhance
source: Rewriting with “%@”…
zh_hans: 正在用「%@」改写…

# popover.loading.translate
source: Translating into %@…
zh_hans: 正在译成%@…

# popover.reauth
source: Re-authorize in System Settings
zh_hans: 去系统设置重新授权

# popover.replace.enhance
source: Replace
zh_hans: 替换原文

# popover.replace.help.enhance
source: Replace the selection with the rewrite
zh_hans: 用改写结果覆盖选中的文字

# popover.replace.help.translate
source: Replace the selection with the translation
zh_hans: 用译文覆盖选中的文字

# popover.replace.translate
source: Replace
zh_hans: 替换为译文

# popover.retry
source: Try again
zh_hans: 再试一次

# popover.start.enhance
source: Rewrite
zh_hans: 开始改写

# popover.start.translate
source: Translate
zh_hans: 开始翻译

# profile.code
source: Coding prompt
zh_hans: 编程提示

# profile.concise
source: Shorter
zh_hans: 更短

# profile.email
source: Email
zh_hans: 写邮件

# profile.explain
source: Plain language
zh_hans: 讲人话

# profile.grammar
source: Proofread
zh_hans: 校对

# profile.image-prompt
source: Image prompt
zh_hans: 生图提示

# profile.professional
source: More formal
zh_hans: 更正式

# profile.reply
source: Reply
zh_hans: 写回复

# profile.social
source: Post
zh_hans: 发帖

# profile.summarize
source: Summarize
zh_hans: 总结

# profiles.add
source: Add style
zh_hans: 添加风格

# profiles.current
source: Current
zh_hans: 当前

# profiles.delete
source: Delete
zh_hans: 删除

# profiles.name
source: Name
zh_hans: 名称

# profiles.newName
source: New style
zh_hans: 新风格

# profiles.newPrompt
source: Rewrite this text for the user’s intent. Keep the original language and key facts.
zh_hans: 按用户意图改写这段文字，保留原文语言和关键事实。

# profiles.prompt
source: Instructions for the model
zh_hans: 给模型的说明

# profiles.title
source: Styles
zh_hans: 风格

# profiles.use
source: Use
zh_hans: 使用

# provider.custom
source: Custom
zh_hans: 自定义

# provider.custom.caption
source: OpenAI-compatible
zh_hans: OpenAI 兼容

# provider.custom.help
source: Enter the base URL, key, and model. Needs OpenAI-compatible /v1/chat/completions.
zh_hans: 填接口地址、密钥和模型名。需要兼容 OpenAI 的 /v1/chat/completions。

# provider.deepseek.caption
source: Recommended · works in China
zh_hans: 推荐 · 国内直连

# provider.deepseek.help
source: Open the DeepSeek console, create an API key, then paste it here.
zh_hans: 打开 DeepSeek 开放平台，创建 API Key 后粘贴过来。

# provider.lmstudio.caption
source: Local models · GUI
zh_hans: 本地模型 · 图形界面

# provider.lmstudio.help
source: Download a model in LM Studio and start the local server (Developer → Start Server), then tap Fetch models. Everything stays on this Mac; no key needed.
zh_hans: 在 LM Studio 里下载模型并启动本地服务（Developer → Start Server），然后点「获取模型列表」选择。数据不出本机，无需密钥。

# provider.moonshot.caption
source: Moonshot
zh_hans: 月之暗面

# provider.moonshot.help
source: Open the Moonshot console, create an API key, then paste it here.
zh_hans: 打开 Moonshot 开放平台，创建 API Key 后粘贴过来。

# provider.ollama.caption
source: Local models · free & offline
zh_hans: 本地模型 · 免费离线

# provider.ollama.help
source: Install and start Ollama, pull a model (e.g. ollama pull qwen3), then tap Fetch models. Everything stays on this Mac; no key needed.
zh_hans: 先安装并启动 Ollama，下载一个模型（如 ollama pull qwen3），然后点「获取模型列表」选择。数据不出本机，无需密钥。

# provider.openai.caption
source: Official API
zh_hans: 官方接口

# provider.openai.help
source: Open OpenAI API keys, create a key, then paste it here.
zh_hans: 打开 OpenAI 的 API keys 页面，创建密钥后粘贴过来。

# providers.recommended
source: Recommended
zh_hans: 推荐

# providers.setCurrent
source: Use this
zh_hans: 设为当前

# providers.title
source: Providers
zh_hans: 服务商

# providers.using
source: In use
zh_hans: 当前使用

# recovery.continueInPanel
source: Continue in panel
zh_hans: 在面板里继续

# recovery.copyOriginal
source: Copy original
zh_hans: 复制原文

# recovery.openPanel
source: Open panel
zh_hans: 打开面板

# refine.casual
source: More casual
zh_hans: 更口语

# refine.formal
source: More formal
zh_hans: 更正式

# refine.placeholder
source: Refine instruction, press Return
zh_hans: 输入微调要求，回车再改

# refine.shorter
source: Shorter
zh_hans: 更短

# result.changes
source: Changes
zh_hans: 改动

# result.edit
source: Result
zh_hans: 结果

# route.jaZh
source: JA→ZH
zh_hans: 日→中

# route.koZh
source: KO→ZH
zh_hans: 韩→中

# route.toZh
source: →ZH
zh_hans: →中

# route.zhEn
source: ZH→EN
zh_hans: 中→英

# section.desktop
source: Desktop
zh_hans: 桌面

# section.language
source: Languages
zh_hans: 语言

# section.permissions
source: Permissions
zh_hans: 权限

# section.selection
source: Selection
zh_hans: 选区

# selection.actionBar
source: Show action bar after selecting text
zh_hans: 选中文字后显示动作条

# selection.actionBar.caption
source: After you release the mouse, Rewrite / Translate appear below the selection so they do not cover the app's Copy menu. Turn this off to use the panel only.
zh_hans: 松开鼠标后，在选区下方出现「改写 / 翻译」，避开应用自带的复制菜单。关掉后只能把文字粘贴到面板里处理。

# shortcuts.chips
source: Rewrite / Translate
zh_hans: 改写 / 翻译

# shortcuts.chips.caption
source: Tap the chips after selecting text
zh_hans: 选中文字后点弹出的按钮

# shortcuts.enhance
source: Rewrite selection
zh_hans: 改写选中文字

# shortcuts.help
source: Select text in WeChat, Notes, or a browser. Rewrite / Translate appear below the selection so they do not cover Copy. Then replace or copy.
zh_hans: 在微信、备忘录里选中文字，选区下方会出现改写 / 翻译，不挡住应用自带的复制菜单。点按钮后，在浮层里替换或复制。

# shortcuts.palette
source: Rewrite with style picker
zh_hans: 选择风格改写

# shortcuts.palette.caption
source: Opens the style palette; pick with number keys
zh_hans: 弹出风格面板，按数字键选择

# shortcuts.panel
source: Open draft panel
zh_hans: 打开草稿面板

# shortcuts.panel.caption
source: Paste text into the panel
zh_hans: 把文字贴进面板再处理

# shortcuts.select
source: Select
zh_hans: 选中

# shortcuts.title
source: Shortcuts
zh_hans: 快捷键

# shortcuts.translate
source: Translate selection
zh_hans: 翻译选中文字

# status.tooltip
source: uyiprompt · Select text, then Rewrite or Translate
zh_hans: uyiprompt · 选中文字后点「改写」或「翻译」

# translate.target
source: Translate into
zh_hans: 翻译目标

# translate.target.caption
source: Auto: Chinese → English, everything else → Chinese.
zh_hans: 自动：中文译成英语，其它语言译成中文。

# window.settings
source: Settings
zh_hans: 设置

# window.welcome
source: Welcome
zh_hans: 欢迎
